*Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк,* 
*длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры,* 
*либо задать на старте выполнения алгоритма.* 
*При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

# Порядок действий для решения задачи
Для решения задачи необходимо разделить действия на следующие логические этапы:

1. Создание массива из текстовых элементов путем запроса их у пользователя.
2. Формирование нового массива на основе заданного согласно условию задачи.
3. Вывод сформированного массива.

# 1. Создание массива из текстовых элементов путем запроса их у пользователя
Для создания и заполнения массива из текстовых строк используем следующий возвратный метод:

```csharp
string [] CreateTextArray (int size)
{
    string [] newArray = new string [size]; // объявляем пустой массив
    Console.WriteLine("Input words for massive: "); // выводим на экран для пользователя, что нужно ввести
    for (int i = 0; i < size; i++) // цикл для заполнения массива
        newArray[i] = new string (Console.ReadLine()); // заполнение элемента на позиции i введенным пользователем элементом
    return newArray; // возврат заполняемого массива
}
```
# 2. Формирование нового массива на основе заданного согласно условию задачи
Для формирования нового массива из элементов созданного массива, длина которых менее или равна 3, используем следующий возвратный метод:

```csharp
string [] WordsLength3 (string [] arrayForFind) 
{
    int j=0; // счетчик элементов в новом массиве
    string [] array3symbols = new string [arrayForFind.Length]; // объявление нового массива, который будет заполняться элементами, соответствующими условию. Длина массива равна длине исходного массива.
    for (int i = 0; i < arrayForFind.Length; i++) // цикл для заполнения массива
    {
        if (arrayForFind[i].Length <= 3) // условие для элемента заданного массива, который войдет в новый массив
            array3symbols[j] = arrayForFind[i]; // заполнение элемента нового массива элементов из заданного, который соответсвует условию
            j++; // переход на следующий элемент нового массива
    }
    return array3symbols;// возврат нового массива
}
```

# 3. Вывод сформированного массива
Для вывода сформированного массива из элементов, отвечающих условию задачи, используем следующий невозвратный метод:

```csharp
void ShowArray (string [] array1)
{
    Console.WriteLine("Elements from 3 or less elements: "); // выводим на экран для пользователя сообщение
    for (int i = 0; i < array1.Length; i++) // цикл для обхода для вывода нового массива
        Console.WriteLine(array1[i]+ " "); // вывод элемента массива
}
```
# Итоговая программа с вызовом методов
После описания методов их вызов производится в следущем порядке:

```csharp
int sizeStart = 5; // задаем размер массива, который должен ввести пользователь

string [] arrayStart = CreateTextArray (sizeStart); // переменная, в которую заносится массив, который ввел пользователь
string [] arrayNew = WordsLength3(arrayStart); // переменная, в которую записан новый массив
ShowArray(arrayNew); // вывод нового массива
```